Enums/ВидыДействийКалендаряБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийКалендаряБухгалтера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументСЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовыеЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДействийКалендаряБухгалтера/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПредметыИсчисления() Экспорт
	
	ПредметыИсчисления = Новый Соответствие;
	
	ПредметыИсчисления.Вставить(Отчет, НСтр("ru = 'отчет, отчета, отчетов'"));
	ПредметыИсчисления.Вставить(Проверка, НСтр("ru = 'проверка, проверки, проверок'"));
	ПредметыИсчисления.Вставить(УплатаНалога, НСтр("ru = 'налог, налога, налогов'"));
	ПредметыИсчисления.Вставить(РегулярныйПлатеж, НСтр("ru = 'платеж, платежа, платежей'"));
	ПредметыИсчисления.Вставить(Зарплата, НСтр("ru = 'зарплата, зарплаты, зарплат'"));
	ПредметыИсчисления.Вставить(ФинОтчетность, НСтр("ru = 'отчет, отчета, отчетов'"));
	ПредметыИсчисления.Вставить(Уведомление, НСтр("ru = 'уведомление, уведомления, уведомлений'"));
	ПредметыИсчисления.Вставить(ТребованиеФНС, НСтр("ru = 'требование ФНС, требования ФНС, требований ФНС'"));
	ПредметыИсчисления.Вставить(ДокументСЭДО, НСтр("ru = 'документ СЭДО, документа СЭДО, документов СЭДО'"));
	
	Возврат ПредметыИсчисления;
	
КонецФункции

#КонецЕсли
